In [63]:
import pandas as pd

In [64]:
df=pd.read_csv("d:\Z-Games\Orders.csv",skiprows=4)

<>:1: SyntaxWarning: invalid escape sequence '\Z'
<>:1: SyntaxWarning: invalid escape sequence '\Z'
C:\Users\micro\AppData\Local\Temp\ipykernel_1224\1382550680.py:1: SyntaxWarning: invalid escape sequence '\Z'
  df=pd.read_csv("d:\Z-Games\Orders.csv",skiprows=4)

In [65]:
df.head()

,Order ID,Order Date,Country,City,Branch,Lat,Lng,Customer First Name,Customer Last Name,Email,Phone Number,Category,Sub Category,Item,SalesPerson ID,Quantity,Unit Price,Discount,Status
0,1.0,1/1/2023,Syria,homs,hs01,34.7326,36.7136,lina,alrrashid,LINA.ALRRASHID@MAIL.COM,Tel: 5634962795,Tablet,Apple iPad,"iPad Pro 12.9""",N498,1.0,999.0,39.96,False
1,2.0,1/1/2023,Saudi Arabia,riyadh,rd01,24.7136,46.6753,omar,eurul,OMAR.EURUL@MAIL.COM,Tel: 5311455624,Smartphone,Samsung Galaxy,Galaxy S21 Ultra,X918,1.0,1199.0,119.90,True
2,3.0,1/1/2023,Saudi Arabia,riyadh,rd03,24.7743,46.7386,iman,iismaeil,IMAN.IISMAEIL@MAIL.COM,Tel: 5272740777,Digital Camera,Panasonic Lumix,Panasonic Lumix GH5,I036,1.0,1299.0,NaN,True
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,4.0,1/1/2023,United Arab Emirates,abu dhabi,ad01,24.4539,54.3773,ahmad,rihan,AHMAD.RIHAN@MAIL.COM,Tel: 5783343440,Tablet,Samsung Galaxy Tab,Galaxy Tab A8,E804,2.0,199.0,27.86,True

In [66]:
df['Discount']=df['Discount'].fillna(int(0))
df=df.dropna()

In [67]:
df.isnull().sum()

Order ID               0
Order Date             0
Country                0
City                   0
Branch                 0
Lat                    0
Lng                    0
Customer First Name    0
Customer Last Name     0
Email                  0
Phone Number           0
Category               0
Sub Category           0
Item                   0
SalesPerson ID         0
Quantity               0
Unit Price             0
Discount               0
Status                 0
dtype: int64

In [68]:

df["Phone Number"]=df["Phone Number"].astype(str).str.replace("Tel:"," ")
df["Phone Number"]=df["Phone Number"].astype(int)
df["Order ID"]=df["Order ID"].astype(int)
df["Quantity"]=df["Quantity"].astype(int)
df["total unit sold"]=df['Quantity']*df["Unit Price"]

In [69]:
df.head()

,Order ID,Order Date,Country,City,Branch,Lat,Lng,Customer First Name,Customer Last Name,Email,Phone Number,Category,Sub Category,Item,SalesPerson ID,Quantity,Unit Price,Discount,Status,total unit sold
0,1,1/1/2023,Syria,homs,hs01,34.7326,36.7136,lina,alrrashid,LINA.ALRRASHID@MAIL.COM,5634962795,Tablet,Apple iPad,"iPad Pro 12.9""",N498,1,999.0,39.96,False,999.0
1,2,1/1/2023,Saudi Arabia,riyadh,rd01,24.7136,46.6753,omar,eurul,OMAR.EURUL@MAIL.COM,5311455624,Smartphone,Samsung Galaxy,Galaxy S21 Ultra,X918,1,1199.0,119.90,True,1199.0
2,3,1/1/2023,Saudi Arabia,riyadh,rd03,24.7743,46.7386,iman,iismaeil,IMAN.IISMAEIL@MAIL.COM,5272740777,Digital Camera,Panasonic Lumix,Panasonic Lumix GH5,I036,1,1299.0,0.00,True,1299.0
4,4,1/1/2023,United Arab Emirates,abu dhabi,ad01,24.4539,54.3773,ahmad,rihan,AHMAD.RIHAN@MAIL.COM,5783343440,Tablet,Samsung Galaxy Tab,Galaxy Tab A8,E804,2,199.0,27.86,True,398.0
5,5,1/1/2023,USA,washington,wh01,38.9072,-77.0369,sami,altawil,Sami.altawil@mail.com,5352774687,Headphones,Sennheiser HD,Sennheiser HD 450BT,Q149,1,129.0,3.87,True,129.0

In [70]:
df["Customer First Name"]=df["Customer First Name"].str.lower().str.capitalize()
df["Customer Last Name"]=df["Customer Last Name"].str.lower().str.capitalize()
df["Order Date"]=pd.to_datetime(df["Order Date"],dayfirst=True,errors="coerce")

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20000 entries, 0 to 20003
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Order ID             20000 non-null  int64
 1   Order Date           20000 non-null  datetime64[ns]
 2   Country              20000 non-null  object
 3   City                 20000 non-null  object
 4   Branch               20000 non-null  object
 5   Lat                  20000 non-null  float64
 6   Lng                  20000 non-null  float64
 7   Customer First Name  20000 non-null  object
 8   Customer Last Name   20000 non-null  object
 9   Email                20000 non-null  object
 10  Phone Number         20000 non-null  int64
 11  Category             20000 non-null  object
 12  Sub Category         20000 non-null  object
 13  Item                 20000 non-null  object
 14  SalesPerson ID       20000 non-null  object
 15  Quantity             20000 non-null  int64
 16  Unit Price           20000 non-null  float64
 17  Discount             20000 non-null  float64
 18  Status               20000 non-null  object
 19  total unit sold      20000 non-null  float64
dtypes: datetime64[ns](1), float64(5), int64(3), object(11)
memory usage: 3.2+ MB

In [72]:
df.head()

,Order ID,Order Date,Country,City,Branch,Lat,Lng,Customer First Name,Customer Last Name,Email,Phone Number,Category,Sub Category,Item,SalesPerson ID,Quantity,Unit Price,Discount,Status,total unit sold
0,1,2023-01-01,Syria,homs,hs01,34.7326,36.7136,Lina,Alrrashid,LINA.ALRRASHID@MAIL.COM,5634962795,Tablet,Apple iPad,"iPad Pro 12.9""",N498,1,999.0,39.96,False,999.0
1,2,2023-01-01,Saudi Arabia,riyadh,rd01,24.7136,46.6753,Omar,Eurul,OMAR.EURUL@MAIL.COM,5311455624,Smartphone,Samsung Galaxy,Galaxy S21 Ultra,X918,1,1199.0,119.90,True,1199.0
2,3,2023-01-01,Saudi Arabia,riyadh,rd03,24.7743,46.7386,Iman,Iismaeil,IMAN.IISMAEIL@MAIL.COM,5272740777,Digital Camera,Panasonic Lumix,Panasonic Lumix GH5,I036,1,1299.0,0.00,True,1299.0
4,4,2023-01-01,United Arab Emirates,abu dhabi,ad01,24.4539,54.3773,Ahmad,Rihan,AHMAD.RIHAN@MAIL.COM,5783343440,Tablet,Samsung Galaxy Tab,Galaxy Tab A8,E804,2,199.0,27.86,True,398.0
5,5,2023-01-01,USA,washington,wh01,38.9072,-77.0369,Sami,Altawil,Sami.altawil@mail.com,5352774687,Headphones,Sennheiser HD,Sennheiser HD 450BT,Q149,1,129.0,3.87,True,129.0

In [73]:
df.to_csv("Around The World Phone Store.csv",index=False)